import streamlit as st
from PIL import Image


def buildMain():
    st.title("Межотраслевой баланс ")
    st.write("")
    st.write("")


    col1, col2, col3 = st.columns([2,6,1])

    with col1:
        st.write("")

    with col2:
        st.image(image=Image.open('static/175.png'),use_column_width=False, caption='Экономико-математическая модель межотраслевого баланса')

    with col3:
        st.write("")
    # st.image(image=Image.open('static/175.png'),
    #          caption='Экономико-математическая модель межотраслевого баланса')

    st.subheader("Определение")
    st.write(
        "Межотраслевой баланс (Межотраслевой баланс производства и распределения продукции) - экономико-математическая модель, характеризующая систему связей между выпуском продукции в одной отрасли и затратами всех других отраслей, участвующих в выпуске данной продукции. ")

    st.write("")

    st.subheader("Описание")
    st.write(
        "Суть межотраслевого баланса состоит в построении таблицы, в которой по вертикали показываются материальные затраты на производство продукции отдельной отрасли, а также прибыль. ")
    st.write(
        "Данные по горизонтали показывают, на какую сумму (или какое количество продукции) передано продукта в другие отрасли народного хозяйства на производственные нужды (промежуточный продукт), а также конечное потребление продукции отрасли, на накопление, возмещение, выбытия и капитальный ремонт и также экспортно-импортное сальдо. ")
    st.write("Межотраслевой баланс детально отражает производственные и хозяйственные связи отраслей. ")
    st.write("Составляется в денежной и натуральной форме. ")
    st.write(
        "Главными показателями межотраслевого баланса являются: </br>"
        "<ul>"
        "<li>**коэффициенты полных затрат**, характеризующие затраты какого-либо продукта на производство единицы другого продукта по всей цепочке взаимосвязанных отраслей; </li>"
        "<li>**коэффициенты прямых затрат** (средняя величина затрат по отрасли в целом). </li>"
        "</ul>",
        unsafe_allow_html=True)

    st.write("---")

    st.subheader("Подсчет коэффициентов прямых материальных затрат.")

    st.write(
        "**Коэффициенты прямых материальных затрат** $(a_{ij})$ показывают объем материальных ресурсов $i$-го вида, необходимый для производства единицы валового продукта $j$-го вида. Матрица $A$ продуктивна, т.к. для всех столбцов сумма элементов меньше единицы.")
    st.latex(r'''
       a_{ij} = x_{ij}/x_j, (i,j = 1,2,...,n), 
       ''')
    st.write("показывающие затраты продукции $i$-й отрасли на производство единицы стоимости $j$-й отрасли.")
    st.write(""" 
        - $x_{i}$ - валовой объем продукции $i$-й отрасли; 
        - $x_{ij}$ - стоимость продукта, произведенного в $i$-й отрасли и потребленного в $j$-й отрасли для изготовления продукции стоимостью $X_j$
        """)

    st.write(
        "Величина условно чистой продукции $Z_i$, равна сумме амортизации, оплаты труда и чистого дохода отрасли $j$:")

    st.write("---")

    st.subheader("Рассчет коэффициентов прямых и полных затрат труда и фондов и плановую потребность.")
    st.write("Подсчет коэффициентов прямой трудоемкости и фондоемкости:")
    st.latex(r'''
           t_j = L_j/X_j  ;  f_j = Ф_j/X_j.
           ''')
    st.write('''
    - **Коэффициенты прямой трудоёмкости $(t_j)$** представляют собой прямые затраты труда на единицу $j$-го вида продукции. Определить их можно как соотношение затрат живого труда в производстве $j$-го продукта $(L_j)$ к объёму производства этого продукта , т.е. к валовому выпуску $(X_j)$. 
    - **Коэффициенты прямой фондоёмкости $(f_j)$** представляют собой величину среднегодовых фондов на единицу $j$-го вида продукции
                       ''')

    st.write("   ")
    st.write("Подсчет плановой потребности в труде и фондах:")
    st.latex(r'''
           L = \sum_{j=1}^{n} t_j x_j  ;  Ф = \sum_{j=1}^{n} f_j x_j
           ''')
    st.write('''
       - **Коэффициенты полных затрат труда $(L)$** определяются как произведение коэффициентов прямой трудоёмкости $(t_j)$ и матрицы коэффициентов полных материальных затрат $(x_j)$;
       - **Коэффициенты полных затрат фондов $(Ф)$** определяются как произведение коэффициентов прямой фондоёмкости $(f_j)$ и матрицы коэффициентов полных материальных затрат $(x_j)$.
                          ''')
    st.write(
        "Эту потребность сначала рассчитаем отдельно по отраслям, а затем просуммируем, чтобы получить общую потребность для всей экономики.")

    st.write("---")
    st.subheader("Проверить основное балансовое соотношение")
    st.image(image=Image.open('static/176.png'),
             caption='Экономико-математическая модель межотраслевого баланса')
    st.latex(r'''
               \sum_{i=1}^{n} X_i = \sum_{j=1}^{n} X_j
              ''')


buildMain()
